# Programming Lesson and Exercises - SQLite<span class="tocSkip"></span>

These programming lessons do not require prior programming experience.

The goal is to teach you the use of _Python 3_ and the _Jupyter Notebook_ software
in the context of _Data Analytics_.

<div class="alert-info alert" role="alert-info">While you read this notebook,
execute all code cells in linear order
from the beginning</div>


# Introduction to this template notebook

* This is a **personal** notebook.
* Make sure you work in a **copy** of `...-template.ipynb`,
**renamed** to `...-yourIDnr.ipynb`,
where `yourIDnr` is your TU/e identification number.

<div class="alert alert-danger" role="danger">Sharing your notebook with others is considered **fraud** under the TU/e regulations.</div>

You are expected to work with Python code in this notebook.

The locations where you should write your solutions can be recognized by
**marker lines**,
which look like this:

>`#//`
>    `BEGIN_TODO [Label]` `Description` `(n points)`
>
>`#//`
>    `END_TODO [Label]`

<div class="alert alert-warning" role="alert">Do NOT modify or delete these marker lines.  Keep them as they are.<br/>
<br/>
NEVER write code <i>outside</i> the marked blocks.
Such code cannot be evaluated.
</div>

Proceed in this notebook as follows:
* **Read** the text.
* **Fill in** your solutions between `BEGIN_TODO` and `END_TODO` marker lines.
* **Run** _all_ code cells (also the ones _without_ your code),
    _in linear order_ from the first code cell.

**Personalize your notebook**:
1. Copy the following three lines of code:

  ```python
  AUTHOR_NAME = 'Your Full Name'
  AUTHOR_ID_NR = '1234567'
  AUTHOR_DATE = 'YYYY-MM-DD'  # when notebook was first modified, e.g. '2018-02-05'
  ```

1. Paste them between the marker lines in the next code cell.
1. Fill in your _full name_, _identification number_, and the current _date_ as strings between quotes.
1. Run the code cell by putting the cursor there and typing **Control-Enter**.

In [1]:
#// BEGIN_TODO [PrEx_ORG_2018.1] Name, Id.nr., Date, as strings (1 point)

AUTHOR_NAME = 'Ysanne Pasveer'
AUTHOR_ID_NR = '1001716'
AUTHOR_DATE = '2018-03-08' 

#// END_TODO [PrEx_ORG_2018.1]

AUTHOR_NAME, AUTHOR_ID_NR, AUTHOR_DATE

('Ysanne Pasveer', '1001716', '2018-03-08')

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#What-you-need" data-toc-modified-id="What-you-need-0.1">What you need</a></span></li></ul></li><li><span><a href="#1.-SQLite-Basics" data-toc-modified-id="1.-SQLite-Basics-1">1. SQLite Basics</a></span><ul class="toc-item"><li><span><a href="#Learning-Objectives-of-This-Section" data-toc-modified-id="Learning-Objectives-of-This-Section-1.1">Learning Objectives of This Section</a></span></li><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1.2">Introduction</a></span><ul class="toc-item"><li><span><a href="#Loading-the-libraries" data-toc-modified-id="Loading-the-libraries-1.2.1">Loading the libraries</a></span></li><li><span><a href="#Common-steps-in-working-with-SQLite-databases" data-toc-modified-id="Common-steps-in-working-with-SQLite-databases-1.2.2">Common steps in working with SQLite databases</a></span></li><li><span><a href="#SQLite-and-Pandas" data-toc-modified-id="SQLite-and-Pandas-1.2.3">SQLite and Pandas</a></span></li></ul></li><li><span><a href="#Step-1.-Connect-to-database" data-toc-modified-id="Step-1.-Connect-to-database-1.3">Step 1. Connect to database</a></span></li><li><span><a href="#Step-2.-Operate-on-database" data-toc-modified-id="Step-2.-Operate-on-database-1.4">Step 2. Operate on database</a></span><ul class="toc-item"><li><span><a href="#Via-Pandas-data-frames" data-toc-modified-id="Via-Pandas-data-frames-1.4.1">Via Pandas data frames</a></span></li><li><span><a href="#Via-SQL-statements" data-toc-modified-id="Via-SQL-statements-1.4.2">Via SQL statements</a></span></li></ul></li><li><span><a href="#Step-3.-Commit-changes-to-database" data-toc-modified-id="Step-3.-Commit-changes-to-database-1.5">Step 3. Commit changes to database</a></span><ul class="toc-item"><li><span><a href="#Rollback-via-rollback()" data-toc-modified-id="Rollback-via-rollback()-1.5.1">Rollback via <code>rollback()</code></a></span></li><li><span><a href="#Commit-via-commit()" data-toc-modified-id="Commit-via-commit()-1.5.2">Commit via <code>commit()</code></a></span></li></ul></li><li><span><a href="#Step-4.-Close-connection-to-database" data-toc-modified-id="Step-4.-Close-connection-to-database-1.6">Step 4. Close connection to database</a></span></li><li><span><a href="#Exercises-1" data-toc-modified-id="Exercises-1-1.7">Exercises 1</a></span><ul class="toc-item"><li><span><a href="#Step-1.-Connect-to-database" data-toc-modified-id="Step-1.-Connect-to-database-1.7.1">Step 1. Connect to database</a></span></li><li><span><a href="#Step-2.-Operate-on-database" data-toc-modified-id="Step-2.-Operate-on-database-1.7.2">Step 2. Operate on database</a></span></li><li><span><a href="#Step-3.-Commit-the-change-to-database." data-toc-modified-id="Step-3.-Commit-the-change-to-database.-1.7.3">Step 3. Commit the change to database.</a></span></li><li><span><a href="#Step-4.-Close-connection-to-database" data-toc-modified-id="Step-4.-Close-connection-to-database-1.7.4">Step 4. Close connection to database</a></span></li></ul></li></ul></li><li><span><a href="#2.-SQLite-Extras-(optional)" data-toc-modified-id="2.-SQLite-Extras-(optional)-2">2. SQLite Extras (optional)</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Placeholders" data-toc-modified-id="Placeholders-2.0.1">Placeholders</a></span></li><li><span><a href="#Placeholders-and-pd.read_sql_query()" data-toc-modified-id="Placeholders-and-pd.read_sql_query()-2.0.2">Placeholders and <code>pd.read_sql_query()</code></a></span></li><li><span><a href="#Placeholders-and-execute()" data-toc-modified-id="Placeholders-and-execute()-2.0.3">Placeholders and <code>execute()</code></a></span></li><li><span><a href="#Placeholders-and-executemany()" data-toc-modified-id="Placeholders-and-executemany()-2.0.4">Placeholders and <code>executemany()</code></a></span></li></ul></li><li><span><a href="#Exercises-2" data-toc-modified-id="Exercises-2-2.1">Exercises 2</a></span></li></ul></li><li><span><a href="#3.-SQL---Structured-Query-Language" data-toc-modified-id="3.-SQL---Structured-Query-Language-3">3. SQL - Structured Query Language</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Select" data-toc-modified-id="Select-3.0.1">Select</a></span></li><li><span><a href="#Joining-tables" data-toc-modified-id="Joining-tables-3.0.2">Joining tables</a></span></li><li><span><a href="#Self-join" data-toc-modified-id="Self-join-3.0.3">Self-join</a></span></li><li><span><a href="#Subqueries,-or-nested-queries" data-toc-modified-id="Subqueries,-or-nested-queries-3.0.4">Subqueries, or nested queries</a></span></li><li><span><a href="#Update" data-toc-modified-id="Update-3.0.5">Update</a></span></li></ul></li><li><span><a href="#Exercises-3" data-toc-modified-id="Exercises-3-3.1">Exercises 3</a></span></li></ul></li><li><span><a href="#4.-Cleaning" data-toc-modified-id="4.-Cleaning-4">4. Cleaning</a></span><ul class="toc-item"><li><span><a href="#df.astype()-to-convert-to-give-type" data-toc-modified-id="df.astype()-to-convert-to-give-type-4.1"><code>df.astype()</code> to convert to give type</a></span></li><li><span><a href="#pd.to_numeric()-to-convert-to-numeric" data-toc-modified-id="pd.to_numeric()-to-convert-to-numeric-4.2"><code>pd.to_numeric()</code> to convert to numeric</a></span></li><li><span><a href="#ts.unique()-to-find-all-values-once" data-toc-modified-id="ts.unique()-to-find-all-values-once-4.3"><code>ts.unique()</code> to find all values once</a></span></li><li><span><a href="#df.duplicated()-to-find-duplicates" data-toc-modified-id="df.duplicated()-to-find-duplicates-4.4"><code>df.duplicated()</code> to find duplicates</a></span></li><li><span><a href="#df.drop_duplicates()-to-remove-duplicates" data-toc-modified-id="df.drop_duplicates()-to-remove-duplicates-4.5"><code>df.drop_duplicates()</code> to remove duplicates</a></span></li><li><span><a href="#df.dropna()-to-remove-rows-with-missing-values" data-toc-modified-id="df.dropna()-to-remove-rows-with-missing-values-4.6"><code>df.dropna()</code> to remove rows with missing values</a></span></li><li><span><a href="#df.fillna()-to-replace-missing-values" data-toc-modified-id="df.fillna()-to-replace-missing-values-4.7"><code>df.fillna()</code> to replace missing values</a></span></li><li><span><a href="#ts.str.strip()-to-strip-characters-from-begin/end-of-strings" data-toc-modified-id="ts.str.strip()-to-strip-characters-from-begin/end-of-strings-4.8"><code>ts.str.strip()</code> to strip characters from begin/end of strings</a></span></li><li><span><a href="#Exercises-4" data-toc-modified-id="Exercises-4-4.9">Exercises 4</a></span></li></ul></li><li><span><a href="#(End-of-Notebook)" data-toc-modified-id="(End-of-Notebook)-5">(End of Notebook)</a></span></li></ul></div>

## What you need

* This notebook
* `country-data.csv` from _Programming Lesson and Exercises - Pandas_ (EDA)

In [2]:
datadir = '../../datasets/country-data/'
file_countries = datadir + 'country-data.csv'


## How to submit your work

You can submit your work to Canvas in the form of this Jupyter notebook,
containing your solutions in the indicated places
(recognizable by the **marker lines** with `... BEGIN_TODO ...` and `... END_TODO ...`).

> **NOTE: Do NOT modify or delete these marker lines.**

1. **Before submitting**, you must run your notebook by doing **Kernel > Restart & Run All**.  
   Make sure that your notebook runs without errors **in linear order**.

2. Submit the executed notebook with your work
   for the appropriate assignment in **Canvas**.

* In the **Momotor** tab in Canvas,
  you can select that assignment again to find some feedback on your submitted work.
  
* If there are any problems reported by _Momotor_,
  then you need to fix those,
  and **resubmit the fixed notebook**.

In case of a high workload on our server
(because many students submit close to the deadline),
it may take longer to receive the feedback.

# 1. SQLite Basics

## Learning Objectives of This Section

After this lesson, you should

* know how to work with SQLite databases through Pandas data frames;
* know how to work with SQLite databases through cursor objects;
* know how to create, update, and delete tables using Python and its `sqlite3` library.

## Introduction

So far, we have dealt with data given as a _single table_,
typically stored in a CSV file and operated on in a Pandas `DataFrame`.
Often, however, the use of a single table leads to unnecessary duplication of data
and difficulties in data processing.

For example,
consider an experiment where we collect data from various patients.
We have data pertaining to each patient:
name, date of birth, and daily weight and temperature measurements.
How to _organize_ that data and store it?
This is important for the _data collection_ process and subsequent
_data analysis_ process.

You could try to put it in one table,
with one row per patient, and columns for name, date of birth, and every day:

| Name | Date of Birth | Day 1 Weight | Day 1 Temperature | Day 2 Weight | Day 2 Temperature | ... |
| :--- | :------------ | -----------: | ----------------: | -----------: | ----------------: | --: |
| A | 1950-01-01 | 60.0 | 37.8 | 59.8 | 38.1 | ... |
| B | 1947-07-15 | 84.3 | 39.2 | 85.0 | 38.5 | ... |
| ... | ... | ... | ... | ... | ... | ... |

The number of columns would grow, and could differ per patient.

You could try to put it in one table,
with one row per patient per day,
and columns for name, date of birth, day, weight, and temperature,
repeating values that stay the same (name and date of birth):

| Name | Date of Birth | Day | Weight | Temperature |
| :--- | :------------ | --: | -----: | ----------: |
| A | 1950-01-01 | 1 | 60.0 | 37.8 |
| B | 1947-07-15 | 1 | 84.3 | 39.2 |
| A | 1950-01-01 | 2 | 59.8 | 38.1 |
| B | 1947-07-15 | 2 | 84.3 | 39.2 |
| ... | ... | ... | ... | ... |

In this approach, some data (necessarily) gets duplicated.

Also, note that patients may not be uniquely identified by name and data of birth.
In the first table, their measurements would still be kept apart.
But in the second table, this starts to be problematic.

Using multiple, related tables is a better approach.
In this case, two tables could be used:

**Patient data**

| ID | Name | Date of Birth |
| -: | :--- | :------------ |
| 13 | A | 1950-01-01 |
| 72 | B | 1947-07-15 |
| ... | ... | ... |

**Measurement data**

| ID | Day | Weight | Temperature |
| -: | --: | -----: | ----------: |
| 13 |  1 | 60.0 | 37.8 |
| 72 |  1 | 84.3 | 39.2 |
| 13 |  2 | 59.8 | 38.1 |
| 72 |  2 | 84.3 | 39.2 |
| ... | ... | ... | ... |

The additional column `ID` relates the two tables,
and helps to keep apart patients with the same name and date of birth.

We assume that you have a basic understanding of how a _relational database_ is organized:

* a collection of (named, related) _tables_, where
* each table consists of a collection of _rows_, where
* each row contains one _value_ per _column_,
* where all values in a column belong to a prescribed _type_.

In this lesson we will use SQL,
a standardized language to work with _relational databases_.
SQL stands for **Structured Query Language**.
It has its own rules for syntax, semantics, and pragmatics.
We'll cover some of these rules later.

We use **SQLite** as _SQL database engine_
(it knows SQL, though not all of it).
Note that SQLite is a separate piece of open-source software,
that is installed as part of Anaconda.
Many programs make use of SQLite internally.

### Loading the libraries

To show examples, we load some Data Analytics libraries first:

In [3]:
import numpy as np  # import auxiliary library, typical idiom
import pandas as pd  # import the Pandas library, typical idiom

Next, we load **`sqlite3`**, a Python library to work with _SQLite_ databases:

In [4]:
import sqlite3

### Common steps in working with SQLite databases

Typically, the following sequence of steps takes place,
when working with an SQLite database.

1. Connect to the database (residing in a file).
2. Operate on the database:

    * execute queries, to retrieve selected values;
    * create, update, or delete rows/values in a table;
    * create, alter (by adding or deleting columns), or delete tables.
    
3. Commit changes to the database, or roll them back.
4. Close the connection to the database.

Steps 2 and 3 can be repeated as desired.

When working with an SQL database,
operations are expressed as **SQL statements**.
SQL statements are executed via a so-called **cursor** object,
that also captures and delivers any results of the SQL statement.

### SQLite and Pandas

The Pandas library offers two functions to work with SQL databases:

* **`pd.read_sql_query()`** : return the query result as a `DataFrame`
* **`df.to_sql()`** : write `DataFrame df` as table to a database

We prefer to use these functions whenever possible.
That way, you don't have to work via cursor objects.

## Step 1. Connect to database

In order to work with a database,
a _connection_ to that database needs to be established.

An SQLite database is stored in a (binary) file in the file system.

You connect to it via

* **`sqlite3.connect(file_name)`**

This function returns a **connection object**,
that you will need in subsequent operations.
It is typically assigned to a variable named `conn`:

In [5]:
conn = sqlite3.connect('countries.db')  # connect to database in file countries.db

If the database file did not yet exist,
it will be created, starting out with an empty database.

## Step 2. Operate on database

Operations on a database can be classified as

* **Create** : a new table
* **Read** : from one or more existing tables
* **Update** : modify a table, by adding, updating, or deleting rows
* **Delete** : an existing table

### Via Pandas data frames

It is easiest to work with an SQLite database
via the Pandas library in terms of complete data frames.

So, lets first get a data frame.
We will grab the country data that we have used before: `country-data.csv`.

In [6]:
# import os

# base_path = "/Users/ysannepasveer/country-data/"
# country_data = "country-data.csv"
# path_to_file = os.path.join(base_path, country_data)
# fd = open(path_to_file , 'r')

# country_data = pd.read_csv("/Users/ysannepasveer/country-data/country-data.csv",na_values=[''], keep_default_na=False)
# country_data.head()

country_data = pd.read_csv(file_countries, na_values=[''], keep_default_na=False)
country_data.head()

,name,alpha_3,tld,continent,capital,area,population
0,Andorra,AND,.ad,EU,Andorra la Vella,468.0,84000
1,United Arab Emirates,ARE,.ae,AS,Abu Dhabi,82880.0,4975593
2,Afghanistan,AFG,.af,AS,Kabul,647500.0,29121286
3,Antigua and Barbuda,ATG,.ag,NA,St. John's,443.0,86754
4,Anguilla,AIA,.ai,NA,The Valley,102.0,13254

Here is how you write that data frame as a new table named `'countries'`
to the database that we just opened using the `DataFrame` method **`to_sql()`**:

In [7]:
country_data.to_sql('countries', conn, if_exists='replace', index=False)

Just some quick notes about the arguments of **`to_sql()`**:

* **`country_data`** is the data frame to put in the database
* **`'countries'`** is the name of the table to create, replace, or append to.
* **`conn`** is a previously opened connection to an SQLite database.
* **`if_exists='replace'`** will replace an existing table by that same name.  
    Default is **`if_exists='fail'`**,
    which will refuse to overwrite an existing table by the given name.  
    Another variant is **`if_exists='append'`**
    to insert all the rows from the data frame into the table.
* **`index=False`** will suppress writing of the data frame's index as a separate column.  
    Default is **`index=True`**,
    which will write the index as a separate column.
    
> **NOTE**: `to_sql()` automatically commits the changes to the database.  
> So, no additional `commit()` is needed.

Now that we have a table in our database, we can **query** it.

A SQL query is stored in a Python string.
Here is an example:

In [8]:
query = '''
    select name, capital, area, population
    from countries
    where area < 1000 and population > 200000
    order by population desc;
'''

This query

* selects all rows from the table `countries`
* that have an area less than 1000 and a population over 200000
* showing only the columns `'name'`, `'capital'`, `'area'`, and `'population`',
* sorted on population in descending order.

It can be executed with the Pandas function **`pd.read_sql_query()`**,
which returns the result as a `DataFrame`:

In [9]:
pd.read_sql_query(query, conn)

                   name     capital   area  population
0             Singapore   Singapore  692.7     4701069
1               Bahrain      Manama  665.0      738004
2                 Macao       Macao  254.0      449198
3                 Malta    Valletta  316.0      403000
4              Maldives        Male  300.0      395650
5  Netherlands Antilles  Willemstad  960.0      300000
6              Barbados  Bridgetown  431.0      285653

### Via SQL statements

Instead of writing an entire data frame as a table,
or reading the entire result of a query into a Pandas `DataFrame`,
you can also work via a so-called **cursor** object.
For operations on a database that are not queries
(that do not return a table),
you _must_ work with a cursor object.

This approach involves the following steps:

1. Create a cursor object.
1. Execute the SQL statement.
1. Optionally, process the result through the cursor object.

The query above is executed as follows using a cursor object.
Since there are no changes, no commit is needed.

In [10]:
cur = conn.cursor()  # 1. Create cursor object.
cur.execute(query)  # 2. Execute SQL statement
cur.fetchall()  # 3. Inspect the result (all rows)

[('Singapore', 'Singapore', 692.7, 4701069),
 ('Bahrain', 'Manama', 665.0, 738004),
 ('Macao', 'Macao', 254.0, 449198),
 ('Malta', 'Valletta', 316.0, 403000),
 ('Maldives', 'Male', 300.0, 395650),
 ('Netherlands Antilles', 'Willemstad', 960.0, 300000),
 ('Barbados', 'Bridgetown', 431.0, 285653)]

We recommend

* to use **`pd.read_sql_query()`** for _queries_ (SELECT statements),
so that the result is conveniently available as a Pandas `DataFrame`, and
* to use **`execute()`** only for other (non-SELECT) SQL statements.

## Step 3. Commit changes to database

If changes have been made to the database through _cursor objects_
then you need to **commit** them in order to persist in the database file,
and become visible to other users of that same database.
Alternatively, you can decide to **rollback** the changes.

> **NOTE**: Changes made through `DataFrame.to_sql()` are committed automatically.  
> It is not possible to rollback in that case.

Let's make a change, via the cursor object that we already have.

First, we inspect the population for the Netherlands:

In [11]:
get_pop_NL = 'select name, population from countries where name = "Netherlands";'
pd.read_sql_query(get_pop_NL, conn)

          name  population
0  Netherlands    16645000

Next, we define a SQL statements to update the population of the Netherlads
to that of 12 Dec 2017
([source](http://www.worldometers.info/world-population/population-by-country/)),
and execute it.

In [12]:
update_pop_NL = '''
    update countries
    set population = 17035938
    where name = "Netherlands";
'''
cur.execute(update_pop_NL);

Let's check the update:

In [13]:
pd.read_sql_query(get_pop_NL, conn)

          name  population
0  Netherlands    17035938

### Rollback via `rollback()`

We could decide to **rollback** (cancel) all _pending_ changes,
via **`conn.rollback()`**:

In [14]:
conn.rollback()

Let's check again:

In [15]:
pd.read_sql_query(get_pop_NL, conn)

          name  population
0  Netherlands    16645000

So, the change was undone.
Now let's make the change again:

In [16]:
cur.execute(update_pop_NL);

### Commit via `commit()`

Finally, we **commit** all _pending_ changes via **`conn.commit()`**,
to make it visible to other users of that database:

In [17]:
conn.commit()

## Step 4. Close connection to database

Once you no longer want to work with the database,
you can (and are encouraged to) close the connection to it:

In [18]:
conn.close()

## Exercises 1

### Step 1. Connect to database

Connect to the the database with country data,
assigning the connection to variable **`conn_1`**.

In [19]:
#// BEGIN_TODO [PrEx_ORG_1_1] Connect to country database (1 point)

conn_1 = sqlite3.connect('countries.db')

#// END_TODO [PrEx_ORG_1_1]

### Step 2. Operate on database

Define a query to select the name, population, and area of all
countries with an area larger than one million square km.

Assign your query as string to the variable **`query_1a`**.

In [20]:
#// BEGIN_TODO [PrEx_ORG_1_2a] Define query_1a (1 point)

query_1a = '''
    select name, population, area
    from countries
    where area > 1000000;
'''

#// END_TODO [PrEx_ORG_1_2a]

query_1a

'\n    select name, population, area\n    from countries\n    where area > 1000000;\n'

Execute the query on the open database, retrieving the result as a Pandas `DataFrame`.

In [21]:
#// BEGIN_TODO [PrEx_ORG_1_2a'] Define query_1a (1 point)

pd.read_sql_query(query_1a, conn_1)

#// END_TODO [PrEx_ORG_1_2a']

                                name  population        area
0                             Angola    13068161   1246700.0
1                         Antarctica           0  14000000.0
2                          Argentina    41343201   2766890.0
3                          Australia    21515754   7686850.0
4                            Bolivia     9947418   1098580.0
5                             Brazil   201103330   8511965.0
6                             Canada    33679000   9984670.0
7   Democratic Republic of the Congo    70916439   2345410.0
8                              China  1330044000   9596960.0
9                           Colombia    47790000   1138910.0
10                           Algeria    34586184   2381740.0
11                             Egypt    80471869   1001450.0
12                          Ethiopia    88013491   1127127.0
13                         Greenland       56375   2166086.0
14                         Indonesia   242968342   1919440.0
15                             India  1173108018   3287590.0
16                              Iran    76923300   1648000.0
17                        Kazakhstan    15340000   2717300.0
18                             Libya     6461454   1759540.0
19                              Mali    13796354   1240000.0
20                          Mongolia     3086918   1565000.0
21                        Mauritania     3205060   1030700.0
22                            Mexico   112468855   1972550.0
23                             Niger    15878271   1267000.0
24                              Peru    29907003   1285220.0
25                            Russia   140702000  17100000.0
26                      Saudi Arabia    25731776   1960582.0
27                             Sudan    35000000   1861484.0
28                              Chad    10543464   1284000.0
29                     United States   310232863   9629091.0
30                      South Africa    49000000   1219912.0

Define a query to select the name, population, and area of all
countries with an area larger than one million square km and the population is less than ten million, ordered in ascending order on area.

Assign your query as string to the variable **`query_1b`**.

In [22]:
#// BEGIN_TODO [PrEx_ORG_1_2b] Define query_1b (1 point)

query_1b = '''
    select name, population, area
    from countries
    where area > 1000000 and population < 10000000
    order by area asc;
    '''

#// END_TODO [PrEx_ORG_1_2b]

query_1a

'\n    select name, population, area\n    from countries\n    where area > 1000000;\n'

Execute the query on the open database, retrieving the result as a Pandas `DataFrame`.

In [23]:
#// BEGIN_TODO [PrEx_ORG_1_2b'] Define query_1b (1 point)

pd.read_sql_query(query_1b, conn_1)

#// END_TODO [PrEx_ORG_1_2b']

         name  population        area
0  Mauritania     3205060   1030700.0
1     Bolivia     9947418   1098580.0
2    Mongolia     3086918   1565000.0
3       Libya     6461454   1759540.0
4   Greenland       56375   2166086.0
5  Antarctica           0  14000000.0

Create a cursor object **`cur_1`** on the county database to execute queries directly.

In [24]:
#// BEGIN_TODO [PrEx_ORG_1_2c] Create cursor object (1 point)

cur_1 = conn_1.cursor()
cur_1.execute(query_1a)
cur_1.fetchall()

#// END_TODO [PrEx_ORG_1_2c]

[('Angola', 13068161, 1246700.0),
 ('Antarctica', 0, 14000000.0),
 ('Argentina', 41343201, 2766890.0),
 ('Australia', 21515754, 7686850.0),
 ('Bolivia', 9947418, 1098580.0),
 ('Brazil', 201103330, 8511965.0),
 ('Canada', 33679000, 9984670.0),
 ('Democratic Republic of the Congo', 70916439, 2345410.0),
 ('China', 1330044000, 9596960.0),
 ('Colombia', 47790000, 1138910.0),
 ('Algeria', 34586184, 2381740.0),
 ('Egypt', 80471869, 1001450.0),
 ('Ethiopia', 88013491, 1127127.0),
 ('Greenland', 56375, 2166086.0),
 ('Indonesia', 242968342, 1919440.0),
 ('India', 1173108018, 3287590.0),
 ('Iran', 76923300, 1648000.0),
 ('Kazakhstan', 15340000, 2717300.0),
 ('Libya', 6461454, 1759540.0),
 ('Mali', 13796354, 1240000.0),
 ('Mongolia', 3086918, 1565000.0),
 ('Mauritania', 3205060, 1030700.0),
 ('Mexico', 112468855, 1972550.0),
 ('Niger', 15878271, 1267000.0),
 ('Peru', 29907003, 1285220.0),
 ('Russia', 140702000, 17100000.0),
 ('Saudi Arabia', 25731776, 1960582.0),
 ('Sudan', 35000000, 1861484.0),
 ('Chad', 10543464, 1284000.0),
 ('United States', 310232863, 9629091.0),
 ('South Africa', 49000000, 1219912.0)]

Define a query to update the country database and set the population for Antarctica to one thousand.

Assign your query as string to the variable **`query_1d`**.

In [25]:
#// BEGIN_TODO [PrEx_ORG_1_2d] Define query_1d (1 point)

query_1d = '''
    update countries
    set population = 1000
    where name = "Antarctica";
    '''

#// END_TODO [PrEx_ORG_1_2d]

query_1d

'\n    update countries\n    set population = 1000\n    where name = "Antarctica";\n    '

Execute the query via the cursor object.

In [26]:
#// BEGIN_TODO [PrEx_ORG_1_2e] Execute query_1d via cursor (1 point)

cur_1.execute(query_1d)

#// END_TODO [PrEx_ORG_1_2e]

### Step 3. Commit the change to database.

Commit the preceding change to the database.

In [27]:
#// BEGIN_TODO [PrEx_ORG_1_3] Commit changes (1 point)

conn_1.commit()

#// END_TODO [PrEx_ORG_1_3]

Define a query to verify the preceding update,
by selecting name and population for Antarctica.

Assign your query as string to the variable **`query_3a`**.

In [28]:
#// BEGIN_TODO [PrEx_ORG_1_3a] Define query_3a (1 point)

query_3a = '''
    select name, population
    from countries
    where name ="Antarctica"
    '''

#// END_TODO [PrEx_ORG_1_3a]

query_3a

'\n    select name, population\n    from countries\n    where name ="Antarctica"\n    '

Execute the query via the cursor object and fetch all the results.

In [29]:
#// BEGIN_TODO [PrEx_ORG_1_3a'] Execute query_1d via cursor (1 point)

cur_1.execute(query_3a)
cur_1.fetchall()

#// END_TODO [PrEx_ORG_1_3a']

[('Antarctica', 1000)]

### Step 4. Close connection to database

Close the connection to the country database.

In [30]:
#// BEGIN_TODO [PrEx_ORG_1_4] Close the country database (1 point)

conn_1.close()

#// END_TODO [PrEx_ORG_1_4]

# 2. SQLite Extras (optional)

We now discuss some useful extra features:

* Placeholders
* Executing a SQL statement for multiple values

First, we reconnect to the database and create a cursor object:

In [31]:
conn = sqlite3.connect('countries.db')
cur = conn.cursor()

### Placeholders

If you need to make several similar queries or updates,
then you can work with **placeholders** in the SQL statement,
and provide _concrete values_ when executing it.
That way, you can use the same SQL statement repeatedly,
and only vary the values.

SQL uses the _question mark_ ('**`?`**') as placeholder.
Here are two example SQL statements with placeholders:

In [32]:
get_population = '''
    select name, population
    from countries
    where name = ?;
'''
update_population = '''
    update countries
    set population = ?
    where name = ?;
'''

### Placeholders and `pd.read_sql_query()`

We get the population of Canada by supplying **`read_sql_query()`** with

* the SQL query `get_population` having a placeholder, and
* the optional keyword argument **`params=["Canada"]`**.

In [33]:
pd.read_sql_query(get_population, conn, params=["Canada"])

     name  population
0  Canada    33679000

> **NOTE**: The argument `params` must be assigned a _list_ of values,
> one for each placeholder in the SQL statement, in order of appearance.

### Placeholders and `execute()`

To update this value to a more recent value
([36,771,617 on 12 Dec 2017](http://www.worldometers.info/world-population/population-by-country/)),
we execute the SQL statement `update_population`.
This time, we supply **`execute()`** with an extra positional argument **`[36_771_617, "Canada"]`**,
since there are now two placeholders to be substituted
(first: a population value; second: a country name).

In [34]:
cur.execute(update_population, [36_771_617, "Canada"]);

> **NOTE**: The syntax for numbers in SQL statements differs from that for Python code.
> Python accepts underscores to improve readability, but SQL does not.
>
> In the example above,
> the Python literal `36_771_617` is converted into SQL syntax by `execute()`.

Let's inspect the change:

In [35]:
pd.read_sql_query(get_population, conn, params=["Canada"])

     name  population
0  Canada    36771617

### Placeholders and `executemany()`

Placeholders pay off even more,
when the same SQL statement is used for multiple lists of concrete values.

Let's illustrate this by updating our database with more up to date population counts
(same source as above):

| Country | Population |
| :------ | ---------: |
| China   | 1,409,517,397 |
| India   | 1,339,180,127 |
| United States | 324,459,463 |

First, we inspect these population values in the database:

In [36]:
get_pop_top3 = '''
    select name, population
    from countries
    where name in ("China", "India", "United States");
'''
pd.read_sql_query(get_pop_top3, conn)

            name  population
0          China  1330044000
1          India  1173108018
2  United States   310232863

They are indeed outdated.
Now we update them all using **`executemany()`**,
supplying it with a list of country-population pairs:

In [37]:
values = [[1_409_517_397, "China"],
          [1_339_180_127, "India"],
          [324_459_463, "United States"]]
cur.executemany(update_population, values);

Let's check:

In [38]:
pd.read_sql_query(get_pop_top3, conn)

            name  population
0          China  1409517397
1          India  1339180127
2  United States   324459463

And commit:

In [39]:
conn.commit()

## Exercises 2

_There are no exercises._

# 3. SQL - Structured Query Language

Also see: [W3 Schools - SQL Tutorial](https://www.w3schools.com/sql/).

The _Structured Query Language_ consists of several sublanguages:

* **DDL** - Data Definition Language (**CREATE**, **ALTER**, **ADD**, **DROP**)
* **DML** - Data Manipulation Language (**SELECT**, **INSERT**, **UPDATE**, **DELETE**)
* **TCL** - Transaction Control Language (**COMMIT**, **ROLLBACK**)
* **DCL** - Data Control Language (dealing with permissions)

In these lessons,
the Data Manipulation Language is most important, and in particular
its **SELECT** statement that _queries_ a database, in order to retrieve selected values.

> **NOTE**: There are many dialects of SQL.
> We use the _SQLite_ dialect, and try to stay close to the _ANSI standard_.

Genereal rules:

* SQL is _not_ case sensitive (`SELECT` and `select` are treated the same way).
* SQL statements are always terminated by a semicolon ('**`;`**').
* To write an identifier that contains spaces or that is the same as a keyword,
    enclose it in **double quotes**.
* SQL uses **single quotes** to enclose string literals.

### Select

The SQL **SELECT** statement retrieves values from a database and
presents the result as a (temporary) table organized in rows and columns.

The SELECT statement has a number of required and optional clauses:

| Clause | Type | Remarks |
| :----- | :--: | :------ |
| `SELECT` _`expr1, expr2, ...`_ | Required | `SELECT *` selects all columns; `SELECT DISTINCT ...` |
| `FROM` _`table1, table2, ...`_ | Required | |
| `... JOIN` _`table`_ `ON` _`condition`_ | Optional | `...` can be `INNER`, `LEFT`, `CROSS` |
| `WHERE` _`condition`_ | Optional | Filter on boolean condition before grouping |
| `GROUP BY` _`column1, column2, ...`_ | Optional | |
| `HAVING` _`condition`_ | Optional | Filter on boolean condition after grouping |
| `ORDER BY` _`column1, column2, ...`_ | Optional | Append `DESC` for descending order |
| `LIMIT` _`number`_ | Optional | Report only first given number of rows |

Numeric expressions _`expr1`_ etc. can contain

* _column names_; must be disambiguated by prepending _table name_: `table1.column1`
* operators: +, -, *, /, %
* functions: MIN, MAX, COUNT, SUM, AVG (these aggregate when `GROUP BY` is used)

Boolean conditions can contain

* _column names_
* comparison operators: =, <>, <, >, <=, >=
* boolean operators: NOT, AND, OR

> **NOTE**: SQLite does not support `RIGHT` and `OUTER` joins.

Here is an example query using `GROUP BY` to obtain an overview of

* all continents, with for each continent
* the number of countries on it
* the total population
* the maximum population over its countries
* the toal area
* the maximum area over its countries

sorted in descending order on number countries:

In [40]:
query = '''
    select continent, count(name), sum(population), max(population), sum(area), max(area)
    from countries
    group by continent
    order by count(name) desc;
'''
pd.read_sql_query(query, conn)

,continent,count(name),sum(population),max(population),sum(area),max(area)
0,AF,58,1016879730,154000000,30360296.00,2381740.0
1,EU,53,739531963,140702000,23079944.09,17100000.0
2,AS,52,4376131847,1409517397,31603228.70,9596960.0
3,NA,42,557424260,324459463,24512514.00,9984670.0
4,OC,27,36066049,21515754,8523505.90,7686850.0
5,SA,14,400143568,201103330,17818508.00,8511965.0
6,AN,5,1170,1000,14012193.00,14000000.0

### Joining tables

Let's first add the continent names as a new table:

In [41]:
continents = pd.DataFrame(
    ['Africa',
     'Antarctica',
     'Asia',
     'Europe',
     'North America',
     'Oceania',
     'South America',
    ],
    index=['AF', 'AN', 'AS', 'EU', 'NA', 'OC', 'SA'],
    columns=['name']
)
continents.to_sql('continents', conn, if_exists='replace')
pd.read_sql_query('select * from continents;', conn)

  index           name
0    AF         Africa
1    AN     Antarctica
2    AS           Asia
3    EU         Europe
4    NA  North America
5    OC        Oceania
6    SA  South America

Now, let's **join** data from the two tables

* `countries` and
* `continents`,

in such a way that each row of `continents` will also show the full name of the continent
for that country.

Note that the column `'continent'` in `countries` uses the exact same encoding for continents
as the column '`index`' of `continents`.
It serves as the **primary key** in `continents`.

We want to keep all rows of `countries`, and copy in the name from `continent`.

In [42]:
query = '''
    select countries.name, capital, continents.name as continent, population
    from countries, continents
    where countries.continent = continents."index" and population > 10000000
    order by population desc
    limit 10;
'''
pd.read_sql_query(query, conn)

            name     capital      continent  population
0          China     Beijing           Asia  1409517397
1          India   New Delhi           Asia  1339180127
2  United States  Washington  North America   324459463
3      Indonesia     Jakarta           Asia   242968342
4         Brazil    Brasilia  South America   201103330
5       Pakistan   Islamabad           Asia   184404791
6     Bangladesh       Dhaka           Asia   156118464
7        Nigeria       Abuja         Africa   154000000
8         Russia      Moscow         Europe   140702000
9          Japan       Tokyo           Asia   127288000

> **NOTES**
> * The column name `name` appears in both tables `countries` and `continents`.  
>     Therefore, we need to prefix it with the table name to disambiguate it.
> * In the result, we want the column with continents to be labeled '`continent`'.  
>     Therefore, we use the _alias_ `as continent`.
> * The column name `index` in table `continents` conflicts with the SQL keyword `INDEX`.  
>     Therefore, we need to double-quote it.

### Self-join

A join between a table and itself.

### Subqueries, or nested queries

The result of one `SELECT` query can be combined with another `SELECT` query.

For instance, `SELECT` queries can be combined by 

* **`UNION`** to obtain the union of the `SELECT` query results
* **`INTERSECTION`** to obtain the intersection of the `SELECT` query results
* **`EXCEPT`** to obtain the rows in the first result without those occurring the second result

We give one example using `EXCEPT`.

* First, we define and execute a query to select continents
    that have countries whose name starts with an 'E'.
* Second, we define and execute a query to select continents
    that have countries whose area exceeds ten million square km.
* Third, we define and execute a query to select continents
    that have countries whose name startts with an 'E'
    but that do _not_ have countries whose area exceeds ten million square km.

In [43]:
query_E = '''
    select continent
    from countries
    where name like \"E%\"
'''
pd.read_sql_query(query_E, conn)

  continent
0        SA
1        EU
2        AF
3        AF
4        AF
5        AF
6        NA
7        OC

In [44]:
query_L = '''
    select continent
    from countries
    where area > 10000000
'''
pd.read_sql_query(query_L, conn)

  continent
0        AN
1        EU

In [45]:
query_E_except_L = query_E + '''
    except
''' + query_L
pd.read_sql_query(query_E_except_L, conn)

  continent
0        AF
1        NA
2        OC
3        SA

### Update

| Clause | Type | Remark |
| :----- | :--: | :----- |
| `UPDATE` _`table`_ | Required | |
| `SET` _`column1`_ `=` _`expr1`_ `,` _`column2`_ `=` _`expr2`_ `, ...` | Required | |
| `WHERE` _`condition`_ | Optional | |
| `ORDER BY` _`column1, column2, ...`_ | Optional | Append `DESC` for descending order |
| `LIMIT` _`number`_ | Optional | Update only first given number of rows |

For an example, see [above](#3.-Commit-changes-to-database).

## Exercises 3

Define a query to select those continents that

* have countries whose name ends in 'd', and
* do _not_ have countries whose population exceeds ten million.

Assign the query to variable **`query_3`**.

In [46]:
#// BEGIN_TODO [PrEx_ORG_3] Define query_3 (1 point)

query_3 = '''
    select continent
    from countries
    where name like \"d%\"
    except
    select name
    from countries
    where population > 10000000
    '''

#// END_TODO [PrEx_ORG_3]

query_3

'\n    select continent\n    from countries\n    where name like "d%"\n    except\n    select name\n    from countries\n    where population > 10000000\n    '

Execute the preceding query.  
Note that the connection `conn` should still be open to the country database.

In [47]:
#// BEGIN_TODO [PrEx_ORG_3'] Execute query_3 (1 point)

pd.read_sql_query(query_3, conn)

#// END_TODO [PrEx_ORG_3']

  continent
0        AF
1        EU
2        NA

Execute the query

Now we close the connection.

In [48]:
conn.close()

# 4. Cleaning

**Raw data** is often not in a form where it can easily be processed.
There can be all kinds of smaller or bigger issues with data.

* extra spaces at the begin and/or end of a string
* missing values
* duplicates
* inconsistencies

The process of preparing data for further processing is called **data cleaning**.

In this section, we deal with a few common issues.

The following Pandas functions for data frames and series are relevant.

Let `df` be a `DataFrame` and `ts` be a `Series` object.
Note that `pd` stands for the Pandas library itself.

For the examples, we use `country_data`.

## `df.astype()` to convert to give type

With **`df.astype()`** you convert it to a given type.
For example, here we convert the population and are to strings:

In [49]:
country_data_as_str = country_data.astype(str)
country_data_as_str['area'].head()

0       468.0
1     82880.0
2    647500.0
3       443.0
4       102.0
Name: area, dtype: object

## `pd.to_numeric()` to convert to numeric

With **`pd.to_numeric()`** you can convert an argument to a numeric type.
The argument can be a _list_ or _Series_.

In [50]:
pd.to_numeric(country_data_as_str['population']).head()

0       84000
1     4975593
2    29121286
3       86754
4       13254
Name: population, dtype: int64

In [51]:
pd.to_numeric(country_data_as_str['area']).head()

0       468.0
1     82880.0
2    647500.0
3       443.0
4       102.0
Name: area, dtype: float64

## `ts.unique()` to find all values once

With `ts.unique()` you obtain an array in which each item of the series appears once.
The order in the array is in the order of appearance in the series object.

In [52]:
country_data['capital'].unique()

array(['Andorra la Vella', 'Abu Dhabi', 'Kabul', "St. John's",
       'The Valley', 'Tirana', 'Yerevan', 'Luanda', nan, 'Buenos Aires',
       'Pago Pago', 'Vienna', 'Canberra', 'Oranjestad', 'Mariehamn',
       'Baku', 'Sarajevo', 'Bridgetown', 'Dhaka', 'Brussels',
       'Ouagadougou', 'Sofia', 'Manama', 'Bujumbura', 'Porto-Novo',
       'Gustavia', 'Hamilton', 'Bandar Seri Begawan', 'Sucre', 'Brasilia',
       'Nassau', 'Thimphu', 'Gaborone', 'Minsk', 'Belmopan', 'Ottawa',
       'West Island', 'Kinshasa', 'Bangui', 'Brazzaville', 'Bern',
       'Yamoussoukro', 'Avarua', 'Santiago', 'Yaounde', 'Beijing',
       'Bogota', 'San Jose', 'Havana', 'Praia', ' Willemstad',
       'Flying Fish Cove', 'Nicosia', 'Prague', 'Berlin', 'Djibouti',
       'Copenhagen', 'Roseau', 'Santo Domingo', 'Algiers', 'Quito',
       'Tallinn', 'Cairo', 'El-Aaiun', 'Asmara', 'Madrid', 'Addis Ababa',
       'Helsinki', 'Suva', 'Stanley', 'Palikir', 'Torshavn', 'Paris',
       'Libreville', 'London', "St. George's", 'Tbilisi', 'Cayenne',
       'St Peter Port', 'Accra', 'Gibraltar', 'Nuuk', 'Banjul', 'Conakry',
       'Basse-Terre', 'Malabo', 'Athens', 'Grytviken', 'Guatemala City',
       'Hagatna', 'Bissau', 'Georgetown', 'Hong Kong', 'Tegucigalpa',
       'Zagreb', 'Port-au-Prince', 'Budapest', 'Jakarta', 'Dublin',
       'Jerusalem', 'Douglas', 'New Delhi', 'Diego Garcia', 'Baghdad',
       'Tehran', 'Reykjavik', 'Rome', 'Saint Helier', 'Kingston', 'Amman',
       'Tokyo', 'Nairobi', 'Bishkek', 'Phnom Penh', 'Tarawa', 'Moroni',
       'Basseterre', 'Pyongyang', 'Seoul', 'Pristina', 'Kuwait City',
       'George Town', 'Astana', 'Vientiane', 'Beirut', 'Castries', 'Vaduz',
       'Colombo', 'Monrovia', 'Maseru', 'Vilnius', 'Luxembourg', 'Riga',
       'Tripoli', 'Rabat', 'Monaco', 'Chisinau', 'Podgorica', 'Marigot',
       'Antananarivo', 'Majuro', 'Skopje', 'Bamako', 'Nay Pyi Taw',
       'Ulan Bator', 'Macao', 'Saipan', 'Fort-de-France', 'Nouakchott',
       'Plymouth', 'Valletta', 'Port Louis', 'Male', 'Lilongwe',
       'Mexico City', 'Kuala Lumpur', 'Maputo', 'Windhoek', 'Noumea',
       'Niamey', 'Abuja', 'Managua', 'Amsterdam', 'Oslo', 'Kathmandu',
       'Yaren', 'Alofi', 'Wellington', 'Muscat', 'Panama City', 'Lima',
       'Papeete', 'Port Moresby', 'Manila', 'Islamabad', 'Warsaw',
       'Saint-Pierre', 'Adamstown', 'San Juan', 'East Jerusalem', 'Lisbon',
       'Melekeok', 'Asuncion', 'Doha', 'Saint-Denis', 'Bucharest',
       'Belgrade', 'Moscow', 'Kigali', 'Riyadh', 'Honiara', 'Victoria',
       'Khartoum', 'Juba', 'Stockholm', 'Singapore', 'Jamestown',
       'Ljubljana', 'Longyearbyen', 'Bratislava', 'Freetown', 'San Marino',
       'Dakar', 'Mogadishu', 'Paramaribo', 'Sao Tome', 'San Salvador',
       'Philipsburg', 'Damascus', 'Mbabane', 'Cockburn Town', "N'Djamena",
       'Port-aux-Francais', 'Lome', 'Bangkok', 'Dushanbe', 'Dili',
       'Ashgabat', 'Tunis', "Nuku'alofa", 'Ankara', 'Port of Spain',
       'Funafuti', 'Taipei', 'Dodoma', 'Kiev', 'Kampala', 'Washington',
       'Montevideo', 'Tashkent', 'Vatican City', 'Kingstown', 'Caracas',
       'Road Town', 'Charlotte Amalie', 'Hanoi', 'Port Vila', 'Mata Utu',
       'Apia', 'Sanaa', 'Mamoudzou', 'Pretoria', 'Lusaka', 'Harare',
       'Willemstad'], dtype=object)

## `df.duplicated()` to find duplicates

With **`df.duplicated()`** you obtain a _boolean mask_
indicating which rows appear more than once.
With the argument **`subset=`** you can restrict the search for duplicates
to specific columns
(either a single column or a list of columns).

In [53]:
bm_dup_capital = country_data.duplicated(subset='capital')
country_data[bm_dup_capital]

,name,alpha_3,tld,continent,capital,area,population
29,"Bonaire, Saint Eustatius and Saba",BES,.bq,NA,NaN,328.0,18012
33,Bouvet Island,BVT,.bv,AN,NaN,49.0,0
95,Heard Island and McDonald Islands,HMD,.hm,AN,NaN,412.0,0
163,Norfolk Island,NFK,.nf,OC,Kingston,34.6,1828
220,Tokelau,TKL,.tk,OC,NaN,10.0,1466
232,United States Minor Outlying Islands,UMI,.um,OC,NaN,0.0,0

There is an extra argument `keep`:

* **`keep='first'`** (default): Mark duplicates as `True` _except for the first occurrence_.
* **`keep='last'`** : Mark duplicates as `True` _except for the last occurrence_.
* **`keep=False`**`: Mark all duplicates as `True`.

In [54]:
bm_dup_capital_all = country_data.duplicated(subset='capital', keep=False)
country_data[bm_dup_capital_all]

,name,alpha_3,tld,continent,capital,area,population
8,Antarctica,ATA,.aq,AN,NaN,14000000.0,0
29,"Bonaire, Saint Eustatius and Saba",BES,.bq,NA,NaN,328.0,18012
33,Bouvet Island,BVT,.bv,AN,NaN,49.0,0
95,Heard Island and McDonald Islands,HMD,.hm,AN,NaN,412.0,0
111,Jamaica,JAM,.jm,NA,Kingston,10991.0,2847232
163,Norfolk Island,NFK,.nf,OC,Kingston,34.6,1828
220,Tokelau,TKL,.tk,OC,NaN,10.0,1466
232,United States Minor Outlying Islands,UMI,.um,OC,NaN,0.0,0

## `df.drop_duplicates()` to remove duplicates

With **`df.drop_duplicates()`** you can remove duplicated rows.
With the argument **`subset=`** you can restrict the search for duplicates to specific columns (either a single column or a list of columns).

In [55]:
country_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 251 entries, 0 to 250
Data columns (total 7 columns):
name          251 non-null object
alpha_3       251 non-null object
tld           249 non-null object
continent     251 non-null object
capital       245 non-null object
area          251 non-null float64
population    251 non-null int64
dtypes: float64(1), int64(1), object(5)
memory usage: 13.8+ KB

In [56]:
country_data.drop_duplicates(subset='capital').info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 245 entries, 0 to 250
Data columns (total 7 columns):
name          245 non-null object
alpha_3       245 non-null object
tld           243 non-null object
continent     245 non-null object
capital       244 non-null object
area          245 non-null float64
population    245 non-null int64
dtypes: float64(1), int64(1), object(5)
memory usage: 15.3+ KB

There is an extra argument `keep`:

* **`keep='first'`** (default): Drop duplicates _except for the first occurrence_.
* **`keep='last'`** : Drop duplicates _except for the last occurrence_.
* **`keep=False`**: Drop all duplicates.

## `df.dropna()` to remove rows with missing values

With **`df.dropna()`** you can remove rows with *missing values*
(_Not-Available_ (NA) and _Not-a-Number_ (NaN)) in a data frame or series object.

With the argument **`how=`** you can indicate whether rows with at least one missing value or with all values missing are dropped:

* **`how='any'`** (default): if any value is missing, drop that row
* **`how='all'`**: if all values are missing, drop that row

In [57]:
country_data_dropna = country_data.dropna()
country_data_dropna.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 243 entries, 0 to 250
Data columns (total 7 columns):
name          243 non-null object
alpha_3       243 non-null object
tld           243 non-null object
continent     243 non-null object
capital       243 non-null object
area          243 non-null float64
population    243 non-null int64
dtypes: float64(1), int64(1), object(5)
memory usage: 15.2+ KB

## `df.fillna()` to replace missing values

With **`df.fillna()`** or **`ts.fillna()`**
you can replace *missing values* (_Not-Available_ (NA) and _Not-a-Number_ (NaN))
in a data frame or series object.

As always, note that this returns a new copy with the filled object.

In [58]:
country_data_filled = country_data['capital'].fillna(value='Unknown')
country_data_filled[country_data_filled.duplicated(keep=False)]

8       Unknown
29      Unknown
33      Unknown
95      Unknown
111    Kingston
163    Kingston
220     Unknown
232     Unknown
Name: capital, dtype: object

## `ts.str.strip()` to strip characters from begin/end of strings

With **`ts.str.strip()`** you can remove characters from the begin and end of all strings in a `Series` object.

Without argument, it strips all leading and trailing **whitespace**.

Here we strip all trailing zeroes from the area that was converted to a string
in an earlier example.

In [59]:
country_data_as_str['area'].str.strip('0')

0           468.
1         82880.
2        647500.
3           443.
4           102.
5         28748.
6         29800.
7       1246700.
8      14000000.
9       2766890.
10          199.
11        83858.
12      7686850.
13          193.
14         1580.
15        86600.
16        51129.
17          431.
18       144000.
19        30510.
20       274200.
21       110910.
22          665.
23        27830.
24       112620.
25           21.
26           53.
27         5770.
28      1098580.
29          328.
         ...
221       15007.
222      488100.
223      163610.
224         748.
225      780580.
226        5128.
227          26.
228       35980.
229      945087.
230      603700.
231      236040.
232            .
233     9629091.
234      176220.
235      447400.
236          .44
237         389.
238      912050.
239         153.
240         352.
241      329560.
242       12200.
243         274.
244        2944.
245      527970.
246         374.
247     1219912.
248      752614.
249      390580.
250         960.
Name: area, Length: 251, dtype: object

---

In [60]:
# List all defined names
%whos

Variable              Type          Data/Info
---------------------------------------------
AUTHOR_DATE           str           2018-03-08
AUTHOR_ID_NR          str           1001716
AUTHOR_NAME           str           Ysanne Pasveer
bm_dup_capital        Series        0      False\n1      Fals<...>nLength: 251, dtype: bool
bm_dup_capital_all    Series        0      False\n1      Fals<...>nLength: 251, dtype: bool
conn                  Connection    <sqlite3.Connection object at 0x10ef0db90>
conn_1                Connection    <sqlite3.Connection object at 0x10ef0d730>
continents            DataFrame                  name\nAF    <...>ceania\nSA  South America
country_data          DataFrame                              <...>n\n[251 rows x 7 columns]
country_data_as_str   DataFrame                              <...>n\n[251 rows x 7 columns]
country_data_dropna   DataFrame                              <...>n\n[243 rows x 7 columns]
country_data_filled   Series        0         Andorra la Vell<...>ength: 251, dtype: object
cur                   Cursor        <sqlite3.Cursor object at 0x117dbf2d0>
cur_1                 Cursor        <sqlite3.Cursor object at 0x117cefea0>
datadir               str           ../../datasets/country-data/
file_countries        str           ../../datasets/country-data/country-data.csv
get_pop_NL            str           select name, population f<...>ere name = "Netherlands";
get_pop_top3          str           \n    select name, popula<...>dia", "United States");\n
get_population        str           \n    select name, popula<...>es\n    where name = ?;\n
np                    module        <module 'numpy' from '/an<...>kages/numpy/__init__.py'>
pd                    module        <module 'pandas' from '/a<...>ages/pandas/__init__.py'>
query                 str           \n    select countries.na<...>ion desc\n    limit 10;\n
query_1a              str           \n    select name, popula<...>  where area > 1000000;\n
query_1b              str           \n    select name, popula<...> order by area asc;\n
query_1d              str           \n    update countries\n <...>ame = "Antarctica";\n
query_3               str           \n    select continent\n <...>pulation > 10000000\n
query_3a              str           \n    select name, popula<...> name ="Antarctica"\n
query_E               str           \n    select continent\n <...>   where name like "E%"\n
query_E_except_L      str           \n    select continent\n <...>  where area > 10000000\n
query_L               str           \n    select continent\n <...>  where area > 10000000\n
sqlite3               module        <module 'sqlite3' from '/<...>3.6/sqlite3/__init__.py'>
update_pop_NL         str           \n    update countries\n <...>e name = "Netherlands";\n
update_population     str           \n    update countries\n <...> ?\n    where name = ?;\n
values                list          n=3

## Exercises 4

_There are no exercises._

---

# (End of Notebook)

&copy; 2017-2018 - **TU/e** - Eindhoven University of Technology - Tom Verhoeff